; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v7 ?v13)
             (pred_12 ?v3 ?v11)
             (pred_9 ?v7 ?v11)
             (pred_4 ?v4 ?v7 )
	     (pred_8 ?v7)
             (pred_2 ?v8)
             (pred_10 ?v3)
             (pred_7 ?v11)
             (pred_1 ?v7)
             (pred_5 ?v3)
             (pred_3 ?v7)
             (pred_11 ))



(:action op_2
:parameters (?v1 ?v12 ?v6 ?v10)
:precondition (and (pred_2 ?v1) (pred_2 ?v12) (pred_10 ?v6) (pred_7 ?v10)
          (pred_6 ?v1 ?v12) (pred_12 ?v6 ?v10)
                   (pred_9 ?v12 ?v10) (pred_8 ?v1) 
                   (pred_1 ?v12) (pred_5 ?v6))
:effect (and  (pred_3 ?v12) (not (pred_1 ?v12))))


(:action op_4
:parameters (?v1 ?v9)
:precondition (and (pred_2 ?v1) (pred_2 ?v9)
               (pred_8 ?v1) (pred_6 ?v1 ?v9) (pred_3 ?v9))
:effect (and (pred_8 ?v9) (not (pred_8 ?v1))))

(:action op_3
:parameters (?v1 ?v6)
:precondition (and (pred_2 ?v1) (pred_10 ?v6) 
                  (pred_8 ?v1) (pred_4 ?v6 ?v1) (pred_11 ))
:effect (and (pred_5 ?v6)
   (not (pred_4 ?v6 ?v1)) (not (pred_11 ))))


(:action op_5
:parameters (?v1 ?v2 ?v5)
:precondition (and (pred_2 ?v1) (pred_10 ?v2) (pred_10 ?v5)
                  (pred_8 ?v1) (pred_5 ?v5) (pred_4 ?v2 ?v1))
:effect (and (pred_5 ?v2) (pred_4 ?v5 ?v1)
        (not (pred_5 ?v5)) (not (pred_4 ?v2 ?v1))))

(:action op_1
:parameters (?v1 ?v6)
:precondition (and (pred_2 ?v1) (pred_10 ?v6) 
                  (pred_8 ?v1) (pred_5 ?v6))
:effect (and (pred_11 ) (pred_4 ?v6 ?v1) (not (pred_5 ?v6)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_19 obj_14 obj_08 obj_04 obj_10 obj_20 obj_05 obj_21 obj_16 obj_11 obj_15 obj_17 obj_01 obj_13 obj_06 obj_02
    obj_07 obj_03
    obj_09 obj_18 obj_12
    )

    (:init
       (pred_11)

       (pred_2 obj_19)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_05)
       (pred_2 obj_21)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_17)
       (pred_2 obj_01)
       (pred_2 obj_13)
       (pred_2 obj_06)
       (pred_2 obj_02)
       (pred_7 obj_07)
       (pred_7 obj_03)
       (pred_10 obj_09)
       (pred_10 obj_18)
       (pred_10 obj_12)

       (pred_6 obj_19 obj_10)
       (pred_6 obj_19 obj_14)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_08)
       (pred_6 obj_14 obj_19)
       (pred_6 obj_08 obj_05)
       (pred_6 obj_08 obj_04)
       (pred_6 obj_08 obj_14)
       (pred_6 obj_04 obj_21)
       (pred_6 obj_04 obj_08)
       (pred_6 obj_10 obj_16)
       (pred_6 obj_10 obj_20)
       (pred_6 obj_10 obj_19)
       (pred_6 obj_20 obj_11)
       (pred_6 obj_20 obj_05)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_20 obj_10)
       (pred_6 obj_05 obj_15)
       (pred_6 obj_05 obj_21)
       (pred_6 obj_05 obj_08)
       (pred_6 obj_05 obj_20)
       (pred_6 obj_21 obj_17)
       (pred_6 obj_21 obj_04)
       (pred_6 obj_21 obj_05)
       (pred_6 obj_16 obj_01)
       (pred_6 obj_16 obj_11)
       (pred_6 obj_16 obj_10)
       (pred_6 obj_11 obj_13)
       (pred_6 obj_11 obj_15)
       (pred_6 obj_11 obj_20)
       (pred_6 obj_11 obj_16)
       (pred_6 obj_15 obj_06)
       (pred_6 obj_15 obj_17)
       (pred_6 obj_15 obj_05)
       (pred_6 obj_15 obj_11)
       (pred_6 obj_17 obj_02)
       (pred_6 obj_17 obj_21)
       (pred_6 obj_17 obj_15)
       (pred_6 obj_01 obj_13)
       (pred_6 obj_01 obj_16)
       (pred_6 obj_13 obj_06)
       (pred_6 obj_13 obj_11)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_06 obj_02)
       (pred_6 obj_06 obj_15)
       (pred_6 obj_06 obj_13)
       (pred_6 obj_02 obj_17)
       (pred_6 obj_02 obj_06)
       (pred_1 obj_13)
       (pred_1 obj_02)
       (pred_1 obj_11)
       (pred_9  obj_13 obj_07)
       (pred_9  obj_02 obj_03)
       (pred_9  obj_11 obj_07)
       (pred_3 obj_19)
       (pred_3 obj_14)
       (pred_3 obj_08)
       (pred_3 obj_04)
       (pred_3 obj_10)
       (pred_3 obj_20)
       (pred_3 obj_05)
       (pred_3 obj_21)
       (pred_3 obj_16)
       (pred_3 obj_15)
       (pred_3 obj_17)
       (pred_3 obj_01)
       (pred_3 obj_06)

       (pred_12  obj_09 obj_07)
       (pred_12  obj_18 obj_03)
       (pred_12  obj_12 obj_07)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_18 obj_20)
       (pred_4 obj_12 obj_17)
       (pred_8 obj_16)
    )

    (:goal (and
       (pred_4 obj_18 obj_08)
       (pred_4 obj_12 obj_21)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_4 obj_16 obj_10)
   deleted: (pred_8 obj_16)
   added: (pred_8 obj_10)
   goals met: 0 of 2
2. (op_4 obj_10 obj_20)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_20)
   goals met: 0 of 2
3. (op_3 obj_20 obj_18)
   deleted: (pred_4 obj_18 obj_20) (pred_11)
   added: (pred_5 obj_18)
   goals met: 0 of 2
4. (op_4 obj_20 obj_14)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_14)
   goals met: 0 of 2
5. (op_4 obj_14 obj_08)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_08)
   goals met: 0 of 2
6. (op_4 obj_08 obj_04)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_04)
   goals met: 0 of 2
7. (op_4 obj_04 obj_21)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_21)
   goals met: 0 of 2
8. (op_4 obj_21 obj_17)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_17)
   goals met: 0 of 2
9. (op_5 obj_17 obj_12 obj_18)
   deleted: (pred_5 obj_18) (pred_4 obj_12 obj_17)
   added: (pred_5 obj_12) (pred_4 obj_18 obj_17)
   goals met: 0 of 2
10. (op_4 obj_17 obj_21)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_21)
   goals met: 0 of 2
11. (op_1 obj_21 obj_12)
   deleted: (pred_5 obj_12)
   added: (pred_11) (pred_4 obj_12 obj_21)
   goals met: 1 of 2
12. (op_4 obj_21 obj_17)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_17)
   goals met: 1 of 2
13. (op_3 obj_17 obj_18)
   deleted: (pred_4 obj_18 obj_17) (pred_11)
   added: (pred_5 obj_18)
   goals met: 1 of 2
14. (op_4 obj_17 obj_21)
   deleted: (pred_8 obj_17)
   added: (pred_8 obj_21)
   goals met: 1 of 2
15. (op_4 obj_21 obj_04)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_04)
   goals met: 1 of 2
16. (op_4 obj_04 obj_08)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_08)
   goals met: 1 of 2
17. (op_1 obj_08 obj_18)
   deleted: (pred_5 obj_18)
   added: (pred_11) (pred_4 obj_18 obj_08)
   goals met: 2 of 2
